{
    "001": {
        "title": "Introduction to Flutter",
        "description": "Flutter is Google’s mobile app SDK for crafting high-quality native interfaces on iOS and Android in record time. Come along to learn how to get started with Flutter as we demonstrate building a small mobile application live on stage.",
        "complexity": "Beginner",
        "tags": [
            "Flutter"
        ],
        "speakers": [
            "brett_morgan"
        ]
    },
    "002": {
        "title": "You might not need Kubernetes and GKE",
        "description": "Kubernetes & GKE isn't always the best tool for the job. It's actually complex, has a steep learning curve, and requires really smart people to make it secure. Then there's service mesh layers like Istio to consider too. PaaS services on the other hand allow average Joe developers like myself look really smart because it's so easy and quick to spin up solutions in the cloud. In this presentation, I'll give an intro to some of the core serverless tools on Google Cloud for building real-time streaming pipelines at massive scale, Once we get the mandatory (boring) slides out of the way, we'll deep dive into the tech with a live demo, and code up a full solution that reads a live Twitter stream and pumps into GCP for analysis in real-time. The talk will cover App Engine Flex (containers), PubSub, Dataflow and BigQuery and Data Studio, and all tied together using Cloud Build. What could possibly go wrong?",
        "complexity": "Intermediate",
        "tags": [
            "Cloud"
        ],
        "speakers": [
            "graham_polley"
        ]
    },
    "003": {
        "title": "Practical Machine Learning for everyone",
        "description": "Machine learning (ML) is changing the way we write software and helping us solve new problems. In this session, you'll learn about how using ML can be as simple as consuming an API. You'll also learn how to bring your own dataset, have an ML model built for you and exposed as a REST API endpoint.",
        "complexity": "Beginner",
        "tags": [
            "Machine Learning"
        ],
        "speakers": [
            "ankur_kotwal"
        ]
    },
    "004": {
        "title": "Finding Nemo",
        "description": "Imagine you are a marine biologist! On weekly basis, you go to specific spots in the ocean to study fish diversity, abundance and behaviour of species over time. You use Baited Remote Underwater Video, or “BRUV” to record what’s happening underwater. You need to classify recorded videos based on date, time and location of the recording. Your task is watching videos frame by frame and write done on which frame you saw fish or any activates. This process is labour intensive and it’s not fun! In this talk you will see how you can benefit from Tensorflow Object Detection API to detect fish in body of water.",
        "complexity": "Intermediate",
        "tags": [
            "Cloud",
            "Machine Learning"
        ],
        "speakers": [
            "azadeh_khojandi"
        ]
    },
    "005": {
        "title": "ARCore \"Shared 3D Worlds\"",
        "description": "This talk first quickly covers intro to Augmented Reality concept. Then covering current base ARCore capabilities. Then talk about rich 3D content and hard life adding this 3D content into apps. Then moving to possible solutions of 3D content problem - Unity, Unreal Engine, SceneForm (Demo). Finally, having rich 3D content in place talk will cover the ways how we can share 3D scenes for multiple users - demonstrating this with ARCore Cloud Anchors (Demo).",
        "complexity": "Intermediate",
        "tags": [
            "Android",
            "Augmented Reality"
        ],
        "speakers": [
            "sergii_kozyrev"
        ]
    },
    "006": {
        "title": "IoT with Data & Analytics",
        "description": "In this talk, we'll demo how to get data from an IoT device, read it in and display it in a dashboard. The focus in the course is on creating a data analytics pipeline, so this is a good course for beginners in the area who want to understand how the different services can work together.",
        "complexity": "Beginner",
        "tags": [
            "Cloud"
        ],
        "speakers": [
            "elizabeth_wu"
        ]
    },
    "007": {
        "title": "Setting up remote teams for success",
        "description": "Technology teams no longer need to be co-located to make great software, but creating a positive working culture for a remote team requires creative thinking. The team at Insured by Us is spread across 12 locations and 5 timezones and we've learned a few things along the way. In this talk I will share a few techniques we've adopted in helping us create a flexible, remote-first working environment.",
        "complexity": "Beginner",
        "tags": [
            "Self and Team Improvement"
        ],
        "speakers": [
            "georgina_robilliard"
        ]
    },
    "008": {
        "title": "“Untitled”, <insert years here>",
        "description": "There are many questions and concerns around blogging. Where do I start? How do I maintain it? Do I have to post every day? Every week? What do I write about? No one is going to like what I write. What is the point? In this talk I share my experiences as a blogger for over fourteen years. Blogging is a terrific way of helping you with your personal development and provides you with a lot of material for reflection. Whether you are a student or have been working in the tech industry for a long time, blogging is something you can start at any time. But the most important thing is: your blog is a collection of stories only you have the power to write; only you have the power to start.",
        "complexity": "Beginner",
        "tags": [
            "Self and Team Improvement"
        ],
        "speakers": [
            "georgie_luhur_cooke"
        ]
    },
    "009": {
        "title": "Why a Whole Country Skipped a Day: Fun with Timezones and Locales",
        "description": "The correct handling of timezones and locales is one of the most under-appreciated parts of software development. Commonly known as a part of internationalisation (i18n), a lot of people underestimate the impact that getting it wrong can have for your users as well as your systems. Drawn from experiences with working on a global network of backend systems, websites and mobile apps in more than 30 locales for the last 10 years, this talk will start with an introduction to the concepts behind time zones and locales. You’re going to learn about the history of time measurement and time synchronisation and how the world eventually ended up with the global system of time zones of today. Today’s model is full of interesting and sometimes outright bizarre quirks and you’ll look at some of best and worst of them. From there you’ll learn about the ideas behind locales and why cultural context is at least as important as a locale’s common collection of purely technical data such a number formats or text direction. After this, the talk will cover how common runtime environments like Android and Java represent these ideas. Technical topics covered are: How does the JVM deal with timezones and locales and in which way is this is handled differently on Android devices? What level of support and libraries does the Android SDK offer for Java and Kotlin? Ways to make your developer life supporting multi-lingual/-locale apps easier. How can you survive a \"WHAT? We have to support daylight-savings-time?\" request? Managing user expectations and dealing with changing timezones/locales at runtime . Eventually, it will be revealed why a whole country skipped a day and what they gained from going through this effort. Stay tuned!",
        "complexity": "Beginner",
        "tags": [
            "Android",
            "Web",
            "Self and Team Improvement"
        ],
        "speakers": [
            "kai_koenig"
        ]
    },
    "010": {
        "title": "De-obfuscating ProGuard",
        "description": "ProGuard is a mystery/blackbox for most of the Android developers. This talk digs a bit deeper on the ProGuard DSL and the Android specific DSL that developers should know about.",
        "complexity": "Beginner",
        "tags": [
            "Android"
        ],
        "speakers": [
            "shan_ul_haq"
        ]
    },
    "011": {
        "title": "One Platform for Your Functions, Applications, and Containers",
        "description": "Learn how you can unify function, application, and container developer workflows under a single API, making you more productive and your system easier to manage.",
        "complexity": "Intermediate",
        "tags": [
            "Cloud"
        ],
        "speakers": [
            "dan_aschwanden"
        ]
    },
    "012": {
        "title": "Functional Programming in Kotlin with Arrow",
        "description": "Kotlin is a great language to introduce functional programming methods into your workflow. Arrow provides a number of abstractions to make the code you write safer to deploy and reuse. This talk will introduce the Arrow library and its use in Kotlin, from abstracting over list based data structures to normalising code between rx, observable and reactive API's. Attendees will learn how to solve common problems using functional programming and why it can be a powerful approach. The talk requires some familiarity with Kotlin, but Java or non-jvm developers won't be missing much.",
        "complexity": "Intermediate",
        "tags": [
            "Cloud", 
            "Web",
            "Android", 
            "Functional Programming"
        ],
        "speakers": [
            "jacob_bass"
        ]
    },
    "132": {
        "description": "Get your badge, coffee, enjoy talking with tech edicts around",
        "icon": "registration",
        "title": "Registration & morning Coffee",
        "image": "https://firebasestorage.googleapis.com/v0/b/gdg-sydney-devfest2018.appspot.com/o/gallery%2FIMG_20171125_083310.jpg?alt=media&token=a7d23281-6afc-4563-8a82-7cedb0a24789"
    },
    "133": {
        "icon": "lunch",
        "title": "Lunch",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Flunch.jpg?alt=media&token=bc82aaff-92cc-4dcc-a00e-2b6f30a40225",
        "description": "Foooooooood!"
    },
    "134": {
        "description": "With all this newly acquired knowledge, I'm sure you want to grab a drink and chat about it!",
        "icon": "coffee-break",
        "title": "Afternoon tea",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fcoffee-break.jpg?alt=media&token=7c2c929b-cb94-4be8-a05a-b3f678136cb7"
    },
    "135": {
        "title": "Morning tea",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fmorning.jpg?alt=media&token=d0da3d64-fc63-48c6-9d41-1460451dca64",
        "description": "Grab yourself a refreshment and have a chat with people around you!",
        "icon": "coffee-break"
    },
    "136": {
        "icon": "opening",
        "title": "GDG DevFest Ukraine 2016 Opening",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fopening.jpg?alt=media&token=aa52dd45-50c9-4e36-9485-c1f9138ecd6b",
        "language": "English",
        "description": "Official start of the conference. Greetings from the organizers, sponsors and partners."
    },
    "137": {
        "description": "Afterparty is a great time to have some fun and meet new people",
        "icon": "party",
        "title": "Afterparty & Networking",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fparty.jpg?alt=media&token=8e413f01-373a-40bf-bb87-1dcf1d8e6af1"
    },
    "138": {
        "title": "Conference closing and contest winners announcements",
        "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fclosing.jpg?alt=media&token=f02d014a-09ee-407e-88c7-b74093e00fed",
        "description": "Make sure you won't miss closing ceremony, all gifts from out sponsors and partners will find their owners during this session."
    },
    "139": {
        "description": "",
        "title": "Keynote",
        "speakers":[
            "lyndon_maher"
        ]
    },
    "140": {
        "title": "TBD",
        "description": "TBD"
    }
}